backend/controllers/FilmsController.php

    public function actionIndex(): string
    {
        $films = Film::find()->all();
---
SELECT * FROM `films`

    private function getFilm($id): Film
    {
        $film = Film::findOne($id);
---
SELECT * FROM `films` WHERE `id`='3'